УТ_для_edt/src/DataProcessors/CRM_РаботаСМессенджеромMAX/CRM_РаботаСМессенджеромMAX.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>CRM_РаботаСМессенджеромMAX</name>
  <attributes>
    <name>Токен</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиБота</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроксиСервер</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроксиПорт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроксиПользователь</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроксиПароль</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресWebhook</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СекретWebhook</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Провайдер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ApiURL</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Сервер</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>MediaURL</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

УТ_для_edt/src/DataProcessors/CRM_РаботаСМессенджеромMAX/Forms/ФормаНастройки/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(Объект, Параметры);
	
	Параметры.Свойство("ПараметрыПрокси", ПараметрыПрокси);
	
	Если Параметры.Свойство("АдресWebhook") Тогда
		Объект.АдресWebhook = Параметры.АдресWebhook;
	КонецЕсли;
	
	Если Параметры.Свойство("СекретWebhook") Тогда
		Объект.СекретWebhook = Параметры.СекретWebhook;
	КонецЕсли;
	
	Если Не Параметры.Свойство("Провайдер") Тогда
		Объект.Провайдер = 0;
	КонецЕсли;
	
	УстановитьСтраницуПровайдера();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Готово(Команда)
	
	Если Не ПроверитьЗаполнениеФормы() Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыДоступа = Новый Структура;
	ПараметрыДоступа.Вставить("Провайдер", Объект.Провайдер);
	ПараметрыДоступа.Вставить("Токен", Объект.Токен);
	ПараметрыДоступа.Вставить("ApiURL", Объект.ApiURL);
	ПараметрыДоступа.Вставить("Сервер", НормализоватьХост(Объект.Сервер));
	ПараметрыДоступа.Вставить("MediaURL", НормализоватьХост(Объект.MediaURL));
	ПараметрыДоступа.Вставить("АдресWebhook", Объект.АдресWebhook);
	ПараметрыДоступа.Вставить("СекретWebhook", Объект.СекретWebhook);
	ПараметрыДоступа.Вставить("ИспользоватьWebhook", ЗначениеЗаполнено(Объект.АдресWebhook));
	
	Если Объект.Провайдер = 1 И Не ЗначениеЗаполнено(Объект.АдресWebhook) Тогда
		УстановитьНастройкиGreen();
	КонецЕсли;
	
	Закрыть(ПараметрыДоступа);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПодключение(Команда)
	
	Попытка
		Если Не ПроверитьЗаполнениеФормы() Тогда
			Возврат;
		КонецЕсли;
		ПроверитьПодключениеСервер();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("en='Connection was successful.';
			|ru='Подключение прошло успешно.'"));
	Исключение
		Инфо = ИнформацияОбОшибке();
		Описание = ?(Инфо.Причина = Неопределено, Инфо.Описание, Инфо.Причина.Описание);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Описание);
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТокенПриИзменении(Элемент)
	Объект.Токен = СокрЛП(Объект.Токен);
КонецПроцедуры

&НаКлиенте
Процедура ApiURLПриИзменении(Элемент)
	Объект.ApiURL = СокрЛП(Объект.ApiURL);
КонецПроцедуры

&НаКлиенте
Процедура ПровайдерПриИзменении(Элемент)
	УстановитьСтраницуПровайдера();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьСтраницуПровайдера()
	
	Если Объект.Провайдер = 1 Тогда
		Элементы.ГруппаПровайдеры.ТекущаяСтраница = Элементы.ГруппаGreenApi;
	Иначе
		Элементы.ГруппаПровайдеры.ТекущаяСтраница = Элементы.ГруппаПрямойMAX;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьЗаполнениеФормы()
	
	Если Не ЗначениеЗаполнено(Объект.Токен) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			?(Объект.Провайдер = 1,
				НСтр("ru='Введите apiTokenInstance Green-API'"),
				НСтр("ru='Введите токен бота MAX'")));
		Возврат Ложь;
	КонецЕсли;
	
	Если Объект.Провайдер = 1 Тогда
		Если Не ЗначениеЗаполнено(Объект.ApiURL) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Введите ID Instance Green-API'"));
			Возврат Ложь;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Объект.Сервер) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				НСтр("ru='Введите хост apiUrl Green-API (например 3100.api.green-api.com)'"));
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Функция НормализоватьХост(Знач Хост)
	
	Хост = СокрЛП(Хост);
	Хост = СтрЗаменить(Хост, "https://", "");
	Хост = СтрЗаменить(Хост, "http://", "");
	Пока Прав(Хост, 1) = "/" Цикл
		Хост = Лев(Хост, СтрДлина(Хост) - 1);
	КонецЦикла;
	Возврат Хост;
	
КонецФункции

&НаСервере
Процедура ПроверитьПодключениеСервер()
	
	ПараметрыПроверки = Новый Структура;
	ПараметрыПроверки.Вставить("Провайдер", Объект.Провайдер);
	ПараметрыПроверки.Вставить("Токен", Объект.Токен);
	ПараметрыПроверки.Вставить("ApiURL", Объект.ApiURL);
	ПараметрыПроверки.Вставить("Сервер", Объект.Сервер);
	ПараметрыПроверки.Вставить("MediaURL", Объект.MediaURL);
	Обработки.CRM_РаботаСМессенджеромMAX.ПроверитьПодключение(ПараметрыПроверки, ПараметрыПрокси);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьНастройкиGreen()
	
	ПараметрыПроверки = Новый Структура("Провайдер, Токен, ApiURL, Сервер, MediaURL, АдресWebhook");
	ЗаполнитьЗначенияСвойств(ПараметрыПроверки, Объект);
	ПараметрыПроверки.Вставить("ПараметрыПрокси", ПараметрыПрокси);
	// Публичный УстановитьWebhook сам уходит в Green при Провайдер = 1.
	Обработки.CRM_РаботаСМессенджеромMAX.УстановитьWebhook(Неопределено, ПараметрыПроверки);
	
КонецПроцедуры

#КонецОбласти
